In [29]:
import pandas as pd

In [30]:
dados = pd.read_csv("https://raw.githubusercontent.com/guilhermeonrails/data-jobs/refs/heads/main/salaries.csv")

In [31]:
dados.head()

,work_year,experience_level,employment_type,job_title,salary,salary_currency,salary_in_usd,employee_residence,remote_ratio,company_location,company_size
0,2025.0,SE,FT,Solutions Engineer,214000,USD,214000,US,100,US,M
1,2025.0,SE,FT,Solutions Engineer,136000,USD,136000,US,100,US,M
2,2025.0,MI,FT,Data Engineer,158800,USD,158800,AU,0,AU,M
3,2025.0,MI,FT,Data Engineer,139200,USD,139200,AU,0,AU,M
4,2025.0,EN,FT,Data Engineer,90000,USD,90000,US,0,US,M

In [32]:
dados.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 133349 entries, 0 to 133348
Data columns (total 11 columns):
 #   Column              Non-Null Count   Dtype
---  ------              --------------   -----
 0   work_year           133339 non-null  float64
 1   experience_level    133349 non-null  object
 2   employment_type     133349 non-null  object
 3   job_title           133349 non-null  object
 4   salary              133349 non-null  int64
 5   salary_currency     133349 non-null  object
 6   salary_in_usd       133349 non-null  int64
 7   employee_residence  133349 non-null  object
 8   remote_ratio        133349 non-null  int64
 9   company_location    133349 non-null  object
 10  company_size        133349 non-null  object
dtypes: float64(1), int64(3), object(7)
memory usage: 11.2+ MB

In [33]:
dados.describe()

           work_year        salary  salary_in_usd   remote_ratio
count  133339.000000  1.333490e+05  133349.000000  133349.000000
mean     2024.358770  1.632833e+05  157617.272098      20.905669
std         0.680627  2.173860e+05   74288.363097      40.590044
min      2020.000000  1.400000e+04   15000.000000       0.000000
25%      2024.000000  1.060200e+05  106000.000000       0.000000
50%      2024.000000  1.470000e+05  146206.000000       0.000000
75%      2025.000000  1.990000e+05  198000.000000       0.000000
max      2025.000000  3.040000e+07  800000.000000     100.000000

In [34]:
dados.shape

(133349, 11)

In [37]:
linhas, colunas = dados.shape[0], dados.shape[1]
print("linhas:", linhas)
print("colunas:", colunas)

linhas: 133349
colunas: 11

In [39]:
dados.columns

Index(['work_year', 'experience_level', 'employment_type', 'job_title',
       'salary', 'salary_currency', 'salary_in_usd', 'employee_residence',
       'remote_ratio', 'company_location', 'company_size'],
      dtype='object')

In [55]:
dados.rename(columns={
    'work_year': 'ano',
    'experience_level': 'experiência',
    'employment_type': 'emprego',
    'job_title': 'cargo',
    'salary': 'salario',
    'salary_currency': 'moeda',
    'salary_in_usd': 'usd',
    'employee_residence': 'residencia',
    'remote_ratio': 'taxa_remota',
    'company_location': 'empresa',
    'company_size': 'tamanho_empresa'
}, inplace=True)

In [60]:
dados['experiência'] = dados['experiência'].map({
    'EN': 'Junior',
    'MI': 'Pleno',
    'SE': 'Sênior',
    'EX': 'Executivo'
})

dados['experiência'].value_counts()

experiência
Sênior       77241
Pleno        40465
Junior       12443
Executivo     3200
Name: count, dtype: int64

In [62]:
dados['emprego'] = dados['emprego'].map({
    'FT': 'Tempo Integral',
    'PT': 'Tempo Parcial',
    'CT': 'Contrato',
    'FL': 'Freelancer'
})

dados['tamanho_empresa'] = dados['tamanho_empresa'].map({
    'S': 'Pequena',
    'M': 'Média',
    'L': 'Grande'
})

dados['moeda'] = dados['moeda'].map({
    'USD': 'Dólar Americano',
    'EUR': 'Euro',
    'GBP': 'Libra Esterlina',
    'INR': 'Rúpia Indiana',
    'CAD': 'Dólar Canadense',
    'AUD': 'Dólar Australiano',
    'SGD': 'Dólar Singapurense',
    'CHF': 'Franco Suíço',
    'SEK': 'Coroa Sueca',
    'NZD': 'Dólar Neozelandês',
    'HKD': 'Dólar de Hong Kong',
    'JPY': 'Iene Japonês',
    'MXN': 'Peso Mexicano',
    'BRL': 'Real Brasileiro',
    'ZAR': 'Rand Sul-Africano'
})

In [57]:
dados['emprego'].value_counts()

emprego
FT    132563
CT       394
PT       376
FL        16
Name: count, dtype: int64

In [58]:
dados['taxa_remota'].value_counts()

taxa_remota
0      105312
100     27718
50        319
Name: count, dtype: int64

In [ ]:
dados['taxa_remota'] = dados['taxa_remota'].map({
    0: 'Presencial',
    50: 'Híbrido',
    100: 'Remoto'
})

dados['taxa_remota'].value_counts()

In [59]:
dados['tamanho_empresa'].value_counts()

tamanho_empresa
M    129561
L      3574
S       214
Name: count, dtype: int64

In [75]:
dados.describe(include='object')

,experiência,emprego,cargo,moeda,residencia,empresa,tamanho_empresa
count,133349,133349,133349,133349,133349,133349,133349
unique,4,1,390,1,102,95,1
top,Sênior,Desconhecido,Data Scientist,Desconhecido,US,US,Desconhecido
freq,77241,133349,17314,133349,119579,119641,133349